/*一。
 * 举例：大象装进冰箱。
 * 面向过程:
 * 打开冰箱-存储大象-关闭冰箱
 * 对于面向过程思想，强调的是过程（动作）。
 * c 语言
 *  
 *  
 *  
 *  面向对象。
 *  对于面向对象思想，强调的是对象（实体）。
 *  冰箱打开
 *  冰箱存储
 *  冰箱关闭
 *  c++ java  c#
 *  特点：
 *  1.面向对象就是一种常见的思想，符合我们的思考习惯
 *  2.面向对象的出现，将复杂的问题简单化
 *  3.面向对象的出现，让曾经在过程中的执行者，变成对象中的指挥者。
 *  
 *  二.
 *  用java语言对现实生活中的事物进行描述。
 *  通过类的形式来体现的。
 *  
 *  怎么描述呢？
 *  对于事物描述通常只关注两个方面、
 *  一个是属性，一个是行为。
 *  
 *  只要明确事物的属性和行为并定义在类中即可。
 *  
 *  对象：其实就是该类事物实实在在的个体。
 *  类与对象之间的关系？
 *  累：事物的描述。
 *  对象：该类事物的实例，在java中通过new来创建的。
 *  
 *  
 *  
 *  ****三种代码块区别
 *    静态代码块
    class Demo
    {
    static //静态代码块
    {
    }
    }
    随着类的加载而执行。而且只执行一次（这跟类的生命周期较长有关）。
    作用：给类进行初始化。
    构造代码块
    class Demo
    {
    { //构造代码块
    }
    }
    类中独立代码块。
    作用：给所有对象进行初始化。
    （构造函数是给对应的对象进行针对性的初始化。）
    局部代码块
    class Demo
    {
    Public void demo()
    {
    { //局部代码块
    }
    }
    }
    方法中的空白代码块。
    作用：限制局部变量的生命周期。
 *  
 *  
 *  
 *  
 *  
 *  
 *  
 */

	
	
	
	
	
	

